Catalogs/КлассификаторТНВЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КлассификаторТНВЭД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементОбработан</Name>
					<Comment>Произведено заполнение единицы измерения при обновлении ИБ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СырьевойТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Маркируется</Name>
					<Comment>[A2105505-384] Разработка по ФДР С13.001 Доработка документа "Заказ клиента" (передача на комиссию)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>злМаркировкаОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>злМаркировкаДляМаркетплейсов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>злМаркировкаДляРозницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторТНВЭД/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЕстьКлассификатор = Метаданные.Справочники.КлассификаторТНВЭД.Макеты.Найти(
		"КлассификаторТоварнойНоменклатурыВнешнеэкономическойДеятельности") <> Неопределено;
	
	Элементы.ФормаПодборИзТНВЭД.Видимость = ПравоДоступа("Редактирование", Метаданные.Справочники.КлассификаторТНВЭД)
		И ЕстьКлассификатор;
	
	// --> Евлахов Игорь Николаевич (Начало) 04.03.2024
	// Задача #3874	
	злПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	// <-- Евлахов Игорь Николаевич (Конец) 04.03.2024
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЕстьКлассификатор Тогда
		Отказ = Истина;
		
		ТекДанные = Элементы.Список.ТекущиеДанные;
		ДополнительныеПараметры = Новый Структура;
		Если Копирование Тогда
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("Код", Элемент.ТекущиеДанные.Код);
			ЗначенияЗаполнения.Вставить("Наименование", Элемент.ТекущиеДанные.Наименование);
			ДополнительныеПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекстВопроса = НСтр("ru = 'Есть возможность подобрать товарную номенклатуру ВЭД из классификатора.
			|Подобрать?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзМакета(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Подбор", Истина);
	ПараметрыФормы.Вставить("ИмяСправочника", "КлассификаторТНВЭД");
		
	ОткрытьФорму("ОбщаяФорма.ДобавлениеЭлементовВКлассификатор", ПараметрыФормы, ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодобратьИзМакета(Неопределено);
	Иначе
		ОткрытьФорму("Справочник.КлассификаторТНВЭД.Форма.ФормаЭлемента", ДополнительныеПараметры, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область злОбработчикиСобытийФормы 

&НаСервере
Процедура злПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	злМодификацияФормы(Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

#КонецОбласти

#Область злСлужебныеПроцедурыИФункции

&НаСервере
Процедура злМодификацияФормы(Отказ, СтандартнаяОбработка)
		
	#Область ЭлементыФормы
	// << 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324
	// КР_Маркируется
	КР_МаркируетсяЭлемент = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Список.КР_Маркируется", Элементы["Список"]);
	// >> 24.08.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-324
	
	// --> Евлахов Игорь Николаевич (Начало) 04.03.2024
	// Задача #3874
	злМаркировкаОстатков = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Список.злМаркировкаОстатков", Элементы["Список"]);
		
	злМаркировкаДляМаркетплейсов = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Список.злМаркировкаДляМаркетплейсов", Элементы["Список"]); 
		
	злМаркировкаДляРозницы = КР_МетодыМодификацииФорм.ВставитьЭлементФормы(
		ЭтотОбъект, "Список.злМаркировкаДляРозницы", Элементы["Список"]);
	// <-- Евлахов Игорь Николаевич (Конец) 04.03.2024
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти
